update figure to mermaid format
